#+title: Organisation
#+COLUMNS: %50ITEM(Task) %7TODO %14CLOCKSUM(Clock)

* Organisation
** DONE [#A] Call - Friday - 1:45 [2/2]
:LOGBOOK:
CLOCK: [2024-01-12 Fri 15:03]--[2024-01-12 Fri 15:16] =>  0:13
CLOCK: [2024-01-12 Fri 13:15]--[2024-01-12 Fri 14:47] =>  1:32
:END:
- [X] call with Anna and Viktor
  - [X] update about the last week
  - [X] suggest Prototyping for Incentives Protocoll
  - [X] scratch out Opti
    - [X] Show Software Design Workflow
  - [X] reiterate Ideas
  - [X] Come up with Demi
- [X] Add some notes to HackMD
  - [X] readjust Opti.md
  - [X] readjust Demi.md (ported)
  - [X] call it a day

** DONE [#B] Bare Setup - Saturday - 3:56 [4/4]
:LOGBOOK:
CLOCK: [2024-01-13 Sat 14:10]--[2024-01-13 Sat 14:59] =>  0:49
CLOCK: [2024-01-13 Sat 13:48]--[2024-01-13 Sat 14:10] =>  0:22
CLOCK: [2024-01-13 Sat 12:56]--[2024-01-13 Sat 13:36] =>  0:40
CLOCK: [2024-01-13 Sat 12:15]--[2024-01-13 Sat 12:43] =>  0:28
CLOCK: [2024-01-13 Sat 11:15]--[2024-01-13 Sat 12:01] =>  0:46
CLOCK: [2024-01-13 Sat 10:03]--[2024-01-13 Sat 10:54] =>  0:51
:END:
- [X] do Github Setup
- [X] setup Organisation.org File
  - [X] send message in TG of how it works
- [X] readjust Demi.md
  - [X] rewrite Demi.md
- [X] skratch out a Figma [8/8]
  - [X] create a Frame
  - [X] add colors
  - [X] add Type Combi
  - [X] clean up
  - [X] create Input Field Component
  - [X] create Button Component
  - [X] generate a better logo(ported)
    - [X] go for a die-cut sticker
    - [X] download font
    - [X] create outline
      - [X] export
      - [X] importe, generate componetnt
    - [X] generate one
  - [X] add Figma to Github

** DONE [#B] Design - Sunday - 1:39 [8/8]
:LOGBOOK:
CLOCK: [2024-01-14 Sun 10:05]--[2024-01-14 Sun 10:22] =>  0:17
CLOCK: [2024-01-14 Sun 08:32]--[2024-01-14 Sun 09:54] =>  1:22
:END:
- [X] generate a better logo(ported)
  - [X] go for a die-cut sticker
  - [X] download font
  - [X] create outline
    - [X] export
    - [X] importe, generate componetnt
  - [X] generate one
- [X] setup up export format
- [X] add Cover
- [X] add Intro
- [X] refine Logo - Inspiration
- [X] create Landing Page, which current Design System
- [X] clean up
- [X] export, add to Github

** DONE [#B] Code - Landing Page - Sunday - 6:21 [19/19]
:LOGBOOK:
CLOCK: [2024-01-15 Mon 00:53]--[2024-01-15 Mon 00:58] =>  0:05
CLOCK: [2024-01-15 Mon 00:37]--[2024-01-15 Mon 00:52] =>  0:15
CLOCK: [2024-01-14 Sun 23:54]--[2024-01-15 Mon 00:32] =>  0:38
CLOCK: [2024-01-14 Sun 23:35]--[2024-01-14 Sun 23:51] =>  0:16
CLOCK: [2024-01-14 Sun 22:18]--[2024-01-14 Sun 23:14] =>  0:56
CLOCK: [2024-01-14 Sun 21:41]--[2024-01-14 Sun 21:48] =>  0:07
CLOCK: [2024-01-14 Sun 21:24]--[2024-01-14 Sun 21:41] =>  0:17
CLOCK: [2024-01-14 Sun 20:16]--[2024-01-14 Sun 20:51] =>  0:35
CLOCK: [2024-01-14 Sun 15:27]--[2024-01-14 Sun 15:31] =>  0:04
CLOCK: [2024-01-14 Sun 14:08]--[2024-01-14 Sun 15:22] =>  1:14
CLOCK: [2024-01-14 Sun 12:03]--[2024-01-14 Sun 12:29] =>  0:26
CLOCK: [2024-01-14 Sun 11:17]--[2024-01-14 Sun 11:59] =>  0:42
CLOCK: [2024-01-14 Sun 10:24]--[2024-01-14 Sun 11:10] =>  0:46
:END:
- [X] add inkathon! to current project somehow
- [X] make package.json somehow work for docs
- [X] make package.json somehow work for frontend
- [X] make package.json somehow work for contracts
- [X] make scripts work in root folder
- [X] make everythin work from root
- [X] commit that mess ina reasonable order ^^
- [X] add current state of Organisation.org
- [X] call with Botond, ask about Validation AI Setup
- [X] write quick notes, add to docs/notes
- [X] rearange docs package, add notes, change logo
- [X] code input field
  - [X] get rid of boilerplate
  - [X] add input css in global.css
  - [X] update aichat to gpt4
  - [X] add state via css
- [X] code button
- [X] align button and input field
- [X] code logo
- [X] code landing page
- [X] build
- [X] commit progress
- [X] deploy draft (postpone, seems timeconsuming)
** DONE CODE - Smart Contract Draft - Monday - 6:20 [10/10]
:LOGBOOK:
CLOCK: [2024-01-15 Mon 19:15]--[2024-01-15 Mon 20:05] =>  0:50
CLOCK: [2024-01-15 Mon 17:36]--[2024-01-15 Mon 17:57] =>  0:21
CLOCK: [2024-01-15 Mon 16:43]--[2024-01-15 Mon 17:13] =>  0:30
CLOCK: [2024-01-15 Mon 16:24]--[2024-01-15 Mon 16:41] =>  0:17
CLOCK: [2024-01-15 Mon 16:07]--[2024-01-15 Mon 16:20] =>  0:13
CLOCK: [2024-01-15 Mon 15:45]--[2024-01-15 Mon 16:07] =>  0:22
CLOCK: [2024-01-15 Mon 15:23]--[2024-01-15 Mon 15:29] =>  0:06
CLOCK: [2024-01-15 Mon 13:36]--[2024-01-15 Mon 14:44] =>  1:08
CLOCK: [2024-01-15 Mon 12:54]--[2024-01-15 Mon 13:32] =>  0:38
CLOCK: [2024-01-15 Mon 12:06]--[2024-01-15 Mon 12:32] =>  0:26
CLOCK: [2024-01-15 Mon 11:35]--[2024-01-15 Mon 12:06] =>  0:31
CLOCK: [2024-01-15 Mon 10:49]--[2024-01-15 Mon 11:11] =>  0:22
CLOCK: [2024-01-15 Mon 10:37]--[2024-01-15 Mon 10:48] =>  0:11
CLOCK: [2024-01-15 Mon 10:24]--[2024-01-15 Mon 10:37] =>  0:13
CLOCK: [2024-01-15 Mon 10:10]--[2024-01-15 Mon 10:22] =>  0:12
:END:
- [X] deploy draft (postpone, seems timeconsuming)
- [X] update doom
- [X] try netlify deploy
- [X] setup netlify config
- [X] deploy on frandemi.netlify.app
- [X] Write stupid contract and compile it
- [X] rename thingies
- [X] deploy on local
- [X] test via cli
- [X] call node and validator in frontend
  - [X] create ContractOverview Component
  - [X] add style for h1, h2, h3, p
  - [X] change background color of page
  - [X] create Design for ContractOverview
    - [X] create Variable Component
    - [X] create Function Component
    - [X] code Variable Component
    - [X] code Function Component
    - [X] combine it in ContractOverview
    - [X] fix css
    - [X] make it reusable
      - [X] make FunctionComp reusable
      - [X] make VariableComp reusable
      - [X] make ContractOverview reusable
    - [X] add it nicey to Main Page
    - [X] change favicon
    - [X] participate in Aleph Hack Call
    - [X] make FunctionComp clicky
      - [X] add Custon Contract
        - [X] figure out how deployment works with current setup
          - [X] start a from the template, figure it out
            - [X] git clone
            - [X] get it running
            - [X] switch to local
              - [X] import alice
            - [X] w.i.p. (ported)

** TODO [#A] CODE - Button Clicky - Tuesday - 1:47 [6/6]
:LOGBOOK:
CLOCK: [2024-01-16 Tue 12:50]--[2024-01-16 Tue 13:05] =>  0:15
CLOCK: [2024-01-16 Tue 12:19]--[2024-01-16 Tue 12:47] =>  0:28
CLOCK: [2024-01-16 Tue 11:46]--[2024-01-16 Tue 12:13] =>  0:27
CLOCK: [2024-01-16 Tue 11:27]--[2024-01-16 Tue 11:42] =>  0:15
CLOCK: [2024-01-16 Tue 10:51]--[2024-01-16 Tue 11:13] =>  0:22
:END:
- [X] figure out how to make contracts deployment.ts file (ported)
- [X] explore bare inkathon workflow
- [X] import Alice in Wallet
- [X] create new contract for testing
- [X] read from contract and display it on Button Click
- [X] write to contract on Button Click (ported)

** TODO [#A] CODE - Button Clicky - Wednesday [9/10]
:LOGBOOK:
CLOCK: [2024-01-17 Wed 14:04]--[2024-01-17 Wed 14:13] =>  0:09
CLOCK: [2024-01-17 Wed 13:29]--[2024-01-17 Wed 14:03] =>  0:34
CLOCK: [2024-01-17 Wed 12:32]--[2024-01-17 Wed 13:16] =>  0:44
CLOCK: [2024-01-17 Wed 11:41]--[2024-01-17 Wed 12:14] =>  0:33
CLOCK: [2024-01-17 Wed 11:03]--[2024-01-17 Wed 11:34] =>  0:31
:END:

- [X] write to contract on Button Click (ported)
- [X] figure out how to make contracts deployment.ts file (ported)
- [X] handle github 2fa without phone
- [X] add plantuml to docs
- [X] add tasklist to docs
- [X] understand workflow and what happens where
- [X] make button clicky in boilerplate
- [X] try to fix script in Demi
  - [X] rewrite contracts scripts and make it works and get deployment
  - [X] rewrite frontend to make it work
- [X] commit it nicley
- [ ] add all current functions.
